/*
Урок 3.
Змінні. Типи змінних. Оголошення та ініціалізація змінних.
Перетворення типів змінних
Учень оголошує та ініціалізує змінні цілого (int),
дробового (double) та текстового (String) типів. Знайомиться
із можливістю тимчасового перетворення змінної цілого типу у змінну дробового типу
 */

/* CLASSROOM TASK
Создать проект
Создать класс Handler с методом main()
Создать 2 переменные целого типа: рост и возраст. Присвоить этим переменным значения.
Создать 2 переменные текстового типа: имя и фамилия. Присвоить этим переменным значения.
Создать 2 переменные дробного типа: вес и размер обуви. Присвоить этим переменным значения.
Вывести на экран все значения одной командой System.out.println()
 */

package variables_3;

public class Handler {
    public static void main(String[] args) {
        //Переменная (поле, field) - область памяти компьютера
        //для хранения чисел или символов
        int x = 5;
        int y = 8;
    }
}

/* HOMEWORK TEST

1. Що буде виведено в результаті виконання коду
    int x = 11;
    double y = 5.5;
    int z = 22;
    System.out.println(z + x / y);

6.0
6
24.0
24
Буде сформовано помилку компіляції

2. Що буде виведено в результаті виконання коду
	int x = 25;
    double y = 5.1;
    int z = 21;
    String a = "23";
    String b = "6.1";
    System.out.println(z + y + b + x + a);

255.16.12523
80
80.2
26.16.12523
Буде сформовано помилку компіляції
 */