/*
Урок 2.
Виведення результатів арифметичних операцій. Конкатенація текстів
Учень виводить результати чотирьох арифметичних дій над цілими та дробовими числами.
Знайомиться із особливостями ділення цілих чисел.
Вивчає особливості одночасного виведення числових і текстових даних
 */
package arithmetic_2;

public class Handler {
    public static void main(String[] args) {

        System.out.println(4+7);
        System.out.println(7-9);
        String name = "Denis";
        System.out.println(name);
        String surname = "Radchenko";
        System.out.println(name + " " + surname);
        //Конкатенация - сцепление строк

        System.out.println(1-8 + "- разница чисел, "+ (6+9) + "- сумма чисел");
        //1 - - разница чисел, 15 - - сумма чисел

        System.out.println(2.8 + 30/8);
    }
}



/* HOMEWORK TEST

1. Що буде виведено в результаті виконання коду:
System.out.println(2.8 + 30/8);

6.55
5.8
4.1
Буде сформовано помилку компіляції

2. Що буде виведено в результаті виконання коду
System.out.println(2.8 + 4.2 + "4" +3.2 + 4.8);

19
19.0
7.048.0
7.043.24.8
748
2.84.243.24.8

 */